// - є сторінка rules.html. Контентом сторінки є заголовки та параграфи. Заголовки (h2) характеризують тему контенту яка вказана в параграфі.
// створити скрипт, котрий зчитує всі заголовки, та робить в блоці з id=content з них список(ul>li), який буде змістом того, що знаходиться на сторінці.
// Скріпт повинен працювати навіть якщо кількість блоків з заголовком та параграфом зміниться.

let elementh2 = document.getElementsByTagName('h2');

let ul = document.createElement('ul');

for (h2 of elementh2) {
  let li = document.createElement('li');
  li.innerText = h2.innerText;
  ul.appendChild(li);
}

let content = document.getElementById('content');
content.appendChild(ul);

// -Є масив котрий характеризує правила. Створити скрипт який ітерує цей масив, та робить кожне правило в окремому блоці.
// При цому в блоці, номер правила записати в свій блок, текст правила записати в свій окремий блок.
// Результатом відпрацювання скріпта повинна бути структура яка міститься в блоці wrap файла rule.html

let rules = [
  {
    title: 'Первое правило Бойцовского клуба.',
    body: 'Никому не рассказывать о Бойцовском клубе.',
  },
  {
    title: 'Второе правило Бойцовского клуба.',
    body: 'Никогда никому не рассказывать о Бойцовском клубе.',
  },
  {
    title: 'Третье правило Бойцовского клуба.',
    body: 'В схватке участвуют только двое.',
  },
  {
    title: 'Четвертое правило Бойцовского клуба.',
    body: 'Не более одного поединка за один раз.',
  },
  {
    title: 'Пятое правило Бойцовского клуба.',
    body: 'Бойцы сражаются без обуви и голые по пояс.',
  },
  {
    title: 'Шестое правило Бойцовского клуба.',
    body: 'Поединок продолжается столько, сколько потребуется.',
  },
  {
    title: 'Седьмое правило Бойцовского клуба.',
    body:
      'Если противник потерял сознание или делает вид, что потерял, или говорит «Хватит» — поединок окончен.',
  },
  {
    title: 'Восьмое и последнее правило Бойцовского клуба.',
    body: 'Новичок обязан принять бой.',
  },
];



for (let rule of rules) {
  let ruleDiv = document.createElement('div');
 document.body.appendChild(ruleDiv);
 let ruleTitle = document.createElement('h2');
 ruleTitle.innerText = `${rule.title}`;
 let ruleBody = document.createElement('p');
 ruleBody.innerText = `${rule.body}`;
 ruleDiv.appendChild(ruleTitle);
  ruleDiv.appendChild(ruleBody);
}



